_posts/2014-11-30-quickstart.html
---
title: "Quickstart"
date: 2014-11-30
layout: post
categories: quickstart
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Emacs4 Battery include</a>
<ul>
<li><a href="#sec-1-1">1.1. Emacs Prelude</a></li>
<li><a href="#sec-1-2">1.2. Emacs-live</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs4 Battery include</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacsの設定作業が面倒という人の為に、適当に良さそうな物を見繕ってみま
す。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Emacs Prelude</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://github.com/bbatsov/prelude">EmacsPrelude</a> はデフォルトのEmacs体験を拡張する事を狙いとして作られ
たEmacsディストリビューションとされています。<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
以下のように入れられます。<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>
</p>
<dl class="org-dl">
<dt> Curlを使った方法 </dt><dd></dd>
</dl>
<pre class="example">
curl -L https://github.com/bbatsov/prelude/raw/master/utils/installer.sh | sh
</pre>
<dl class="org-dl">
<dt> Wgetを使った方法 </dt><dd></dd>
</dl>
<pre class="example">
wget --no-check-certificate https://github.com/bbatsov/prelude/raw/master/utils/installer.sh -O - | sh
</pre>
<dl class="org-dl">
<dt> Gitを使った方法 </dt><dd></dd>
</dl>
<pre class="example">
git clone git://github.com/bbatsov/prelude.git path/to/local/repo
ln -s path/to/local/repo ~/.emacs.d
cd ~/.emacs.d
</pre>

<p>
<b>そのうち残りをかく</b>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Emacs-live</h3>
<div class="outline-text-3" id="text-1-2">
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
公式のREADMEより
</p></div>


</div>
</div>
